app/views/admin/index.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                    %td= order.id
                    %td= order.user.first_name + " " + order.user.last_name