app/views/admin/reports.haml

SELECT "users".* FROM "users" WHERE 1=0
SELECT COUNT(*) FROM "users"
SELECT states.state_name AS name, count(users.id) AS count FROM "states" INNER JOIN "users" ON "users"."state_id" = "states"."id" GROUP BY states.id ORDER BY count DESC
---
                %th Number of Users
            - ReportingHelper.states_with_users.each do | state_name, user_count |