app/views/users/edit.haml

SELECT "states".* FROM "states"
---
              .col-3
                = f.input :state_id, :collection => State.all,:label_method => :state_name,:value_method => :id, :label => "State" ,:include_blank => false, selected: @user.state_id
            .row
              .col-6