app/views/items/show.haml

    .col-md-5.ml-auto.card.shop-card
      -if @item.item_images.any?
---
SELECT  "item_images".* FROM "item_images" WHERE "item_images"."item_id" = $1 ORDER BY "item_images"."id" ASC LIMIT $2  [["item_id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "item_images" WHERE "item_images"."item_id" = $1 LIMIT $2  [["item_id", 2], ["LIMIT", 1]]