app/controllers/admin_controller.rb

  def index
    @uforders = Order.where(order_status: 1).order(:created_at => :desc).paginate(:page => params[:page], :per_page => 15)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."order_status_id" = 1 ORDER BY "orders"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."order_status_id" = 1

  def items
    @items = Item.all.order(:available => :desc, :name => :asc)
---
SELECT "items".* FROM "items" ORDER BY "items"."available" DESC, "items"."name" ASC

  def reports
    @states_with_orders = State.joins(:orders).order(:state_name).pluck(:state_id, :state_name).uniq #Get states that have an order
    @user_order_report = ReportingHelper.user_total_sales
    logger.warn(@user_order_report)
    @groupedbymonth = ReportingHelper.orders_by_month
    @user_count = User.count
---
SELECT states.state_name AS name, count(users.id) AS count FROM "states" INNER JOIN "users" ON "users"."state_id" = "states"."id" GROUP BY states.id ORDER BY count DESC
SELECT COUNT(*) FROM "users"