app/controllers/items_controller.rb

  def index
    @items = Item.where(available: :true).includes(:item_images)
---
SELECT "item_images".* FROM "item_images" WHERE "item_images"."item_id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12)
SELECT "items".* FROM "items" WHERE "items"."available" = $1  [["available", "true"]]